examples/all-executors.yml
---
services:
- virtual-display
- module: shellexec
  prepare: 
  - command: python -m SimpleHTTPServer 8000
    background: true
  - command: sleep 300 && exit 1   this will make it interrupt in case it hangs
    background: true
#  check:
#  - command: ps auxff > processlist.txt
#    cwd: artifacts-dir

reporting:
- module: passfail
  criteria:
  - fail>0 for 1s

execution:
- executor: selenium
  concurrency: 1
  hold-for: 10s
  iterations: 10
  scenario:
    browser: Firefox
    requests:
      - url: http://localhost:8000/
        label: selenium-firefox

---
services:
- screenshoter

modules:
  screenshoter:
    crop-top: 0
    crop-left: 0
    crop-bottom: 0
    crop-right: 0